Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 256, 256, 3) 0                                            
__________________________________________________________________________________________________
sequential (Sequential)         (None, 128, 128, 64) 3072        input_1[0][0]                    
__________________________________________________________________________________________________
sequential_1 (Sequential)       (None, 64, 64, 128)  131584      sequential[0][0]                 
__________________________________________________________________________________________________
sequential_2 (Sequential)       (None, 32, 32, 256)  525312      sequential_1[0][0]               
__________________________________________________________________________________________________
sequential_3 (Sequential)       (None, 16, 16, 512)  2099200     sequential_2[0][0]               
__________________________________________________________________________________________________
sequential_4 (Sequential)       (None, 8, 8, 512)    4196352     sequential_3[0][0]               
__________________________________________________________________________________________________
sequential_5 (Sequential)       (None, 4, 4, 512)    4196352     sequential_4[0][0]               
__________________________________________________________________________________________________
sequential_6 (Sequential)       (None, 2, 2, 512)    4196352     sequential_5[0][0]               
__________________________________________________________________________________________________
sequential_7 (Sequential)       (None, 1, 1, 512)    4196352     sequential_6[0][0]               
__________________________________________________________________________________________________
sequential_8 (Sequential)       (None, 2, 2, 512)    4196352     sequential_7[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 2, 2, 1024)   0           sequential_8[0][0]               
                                                                 sequential_6[0][0]               
__________________________________________________________________________________________________
sequential_9 (Sequential)       (None, 4, 4, 512)    8390656     concatenate[0][0]                
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 4, 4, 1024)   0           sequential_9[0][0]               
                                                                 sequential_5[0][0]               
__________________________________________________________________________________________________
sequential_10 (Sequential)      (None, 8, 8, 512)    8390656     concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 8, 8, 1024)   0           sequential_10[0][0]              
                                                                 sequential_4[0][0]               
__________________________________________________________________________________________________
sequential_11 (Sequential)      (None, 16, 16, 512)  8390656     concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 16, 16, 1024) 0           sequential_11[0][0]              
                                                                 sequential_3[0][0]               
__________________________________________________________________________________________________
sequential_12 (Sequential)      (None, 32, 32, 256)  4195328     concatenate_3[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 32, 32, 512)  0           sequential_12[0][0]              
                                                                 sequential_2[0][0]               
__________________________________________________________________________________________________
sequential_13 (Sequential)      (None, 64, 64, 128)  1049088     concatenate_4[0][0]              
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 64, 64, 256)  0           sequential_13[0][0]              
                                                                 sequential_1[0][0]               
__________________________________________________________________________________________________
sequential_14 (Sequential)      (None, 128, 128, 64) 262400      concatenate_5[0][0]              
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 128, 128, 128 0           sequential_14[0][0]              
                                                                 sequential[0][0]                 
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 256, 256, 1)  1153        concatenate_6[0][0]              
==================================================================================================
Total params: 54,420,865
Trainable params: 54,409,985
Non-trainable params: 10,880
__________________________________________________________________________________________________
